Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--leaflet_overview.tmx
Source language: en
Languages: ja

source: Browser/Mobile Map Library
ja: ブラウザ/モバイル向け地図ライブラリ

source: Leaflet is an JavaScript library for browser based, mobile-friendly, interactive maps. It is light weight, yet has all the features most developers ever need for online maps.
ja: Leaflet はブラウザベースで、モバイルフレンドリーなインタラクティブ地図のための JavaScript ライブラリです。軽量ですが、ほとんどの開発者がかつて必要としていたオンライン地図のための全ての機能を持っています。

source: Leaflet is designed with simplicity, performance and usability in mind. It works efficiently across all major desktop and mobile platforms out of the box, taking advantage of HTML5 and CSS3 on modern browsers while being accessible on older ones too. It can be extended with many plugins, has a beautiful, easy to use and well-documented API and a simple, readable source code that is a joy to contribute to.
ja: Leaflet はシンプル、パフォーマンス、ユーザビリティを念頭に設計されています。枠を超えた、全てのメジャーなデスクトップ・モバイルプラットフォーム上で、モダンブラウザ上の HTML5 と CSS3 の優位性を持ちつつ、古いブラウザ上でのアクセスも可能とし、効率的に動作します。多くのプラグインにより拡張することが可能で、見た目も美しく、利用も簡単で、しっかりとドキュメント化された API があり、シンプルで、可読性のあるソースコードで、貢献を楽しめるようにもなっています。

source: Core Features
ja: 主要機能

source: Map Layers
ja: 地図レイヤ

source: Tiles, Markers, Popups, Image overlays, WMS, GeoJSON
ja: タイル、マーカー、ポップアップ、イメージオーバーレイ、WMS、GeoJSON

source: Vectors: polylines, polygons, circles, rectangles, circle markers
ja: ベクタ: ポリライン、ポリゴン、円、矩形、円マーカー

source: Layer groups
ja: レイヤグループ

source: Customization Features
ja: カスタマイズ機能

source: Pure CSS3 popups and controls for easy restyling
ja: 簡単なスタイル変更が可能な、CSS3 完全準拠のポップアップとコントロール

source: Image- and HTML-based markers
ja: 画像と HTML ベースのマーカー

source: Custom map layers, controls, projections
ja: カスタム地図レイヤ、コントロール、投影法

source: Powerful OOP facilities for extending existing classes
ja: 既存のクラス拡張のための、強力な OOP(オブジェクト指向プログラミング) の利便性

source: Interaction and Visual Features
ja: インタラクティブでビジュアルな機能

source: Drag panning with inertia
ja: イナーシャによるドラッグパン

source: Keyboard navigation
ja: キーボードナビゲーション

source: Multi-touch
ja: マルチタッチ

source: Zoom/Panning animation
ja: ズーム/パン アニメーション

source: Very nice default design for markers, popups and other map controls
ja: 非常に美しい、マーカー、ポップアップ、その他地図コントロールのデフォルトのデザイン

source: Retina resolution support for tile layers and markers
ja: タイルレイヤとマーカーのための Retina 解像度のサポート

source: Performance Features
ja: パフォーマンス機能

source: Hardware acceleration
ja: ハードウェアアクセラレーション

source: Utilizing CSS3 features to make panning and zooming really smooth
ja: パンとズーム動作を真にスムーズにするための、CSS3 機能の利用

source: Smart polyline/polygon rendering
ja: スマートなポリライン/ポリゴンのレンダリング

source: Modular design allows including only required features
ja: 必要な機能のみ含めることが可能なモジュール設計

source: Tap delay elimination on mobile devices
ja: モバイル端末上でのタップ操作の遅延除去

source: Map Controls
ja: 地図コントロール

source: Zoom buttons, Attribution, Layer switcher, Scale
ja: ームボタン、地図帰属表示、レイヤ切替、縮尺

source: Desktop Browser Support
ja: デスクトップブラウザのサポート

source: Mobile Browser Support
ja: モバイルブラウザのサポート

source: Android browser 2.2+, 3.1+, 4+
ja: Android ブラウザ 2.2+, 3.1+, 4+

source: Chrome for Android 4+ and iOS
ja: Chrome for Android 4+ 及び iOS

source: Other webkit-based browsers (webOS, Blackberry 7+, etc.)
ja: その他 webkit ベースのブラウザ (webOS、Blackberry 7+ 等)

source: IE10/IE11 for Win8-based devices
ja: IE10/IE11 for Win8 ベースの端末

source: Misc
ja: その他

source: Extremely lightweight — around 34 KB of gzipped JS code
ja: 極めて軽量 — JS コードを gzip 圧縮した状態で 34 KB

source: No external dependencies
ja: 外部依存性がない

source: Keeps your JS environment clean — no global or native prototypes pollution
ja: 開発者の JS 環境をクリーンに保つ — グローバルもしくはネイティブの prototype を汚染しない

source: Details
ja: 詳細

source: **Website:** https://leafletjs.com
ja: **Webサイト:** https://leafletjs.com

source: **Licence:** BSD
ja: **ライセンス:** BSD

source: **Software Version:** |version-leaflet|
ja: **ソフトウェアバージョン:** |version-leaflet|

source: **Supported Platforms:** Windows, Mac, Linux, Android, iOS
ja: **対応プラットフォーム:** Windows, Mac, Linux, Android, iOS

source: **API Interfaces:** Javascript
ja: **API インターフェイス:** Javascript

source: **Support:** https://groups.google.com/forum/#!forum/leaflet-js
ja: **サポート:** https://groups.google.com/forum/#!forum/leaflet-js

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/leaflet_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/leaflet_quickstart>`
